In [3]:
import pandas as pd

# DataFrame
- 2차원 배열
- 행과 열로 구성

In [4]:
# Dictionary를 이용한 DataFrame 생성
# list 는 샘플 row 가 쌓이고 Diction은 열이 쌓임
dict_data = {'c0':[1,2,3],'c1':[4,5,6],"c2":[7,8,9], "c3":[10,11,12],"c4":[13,14,15]}
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [5]:
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [6]:
# List를 이용한 DataFrame 생성
df = pd.DataFrame(
    [[15,'남','덕영중'],
    [17,'여','수리중']],
    index=['준서','예은'],
    columns=['나이','성별','학교']
)

In [7]:
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [8]:
# 행과 열 이름 변경하기
print(df.index)
print(df.columns)

Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

In [9]:
# 행 인덱스, 열 이름 변경하기 - 1
df.index = ['학생1','학생2']
df.columns = ['연령','남녀','소속']
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [10]:
df = pd.DataFrame(
    [[15,'남','덕영중'],
    [17,'여','수리중']],
    index=['준서','예은'],
    columns=['나이','성별','학교']
)
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [11]:
df.rename(columns={'나이':'연령','성별':'남녀','학교':'소속'}, inplace=True)
#df = df.rename(columns={'나이':'연령','성별':'남녀','학교':'소속'})
df

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [12]:
# 행 이름 변경하기
# df의 행 인덱스 중에서, '준서'를 '학생1'로, '예은'을 '학생2'로 바꾸기
df.rename(index={'준서':'학생1','예은':'학생2'},inplace=True)
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [13]:
data = [[90,98,85,100],[80,89,95,90],[70,95,100,90]]

In [14]:
df2 = pd.DataFrame(data=data, index=['서준','우현','인아'],columns= ['수학','영어','음악','체육'])
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [15]:
dic = {
    '수학':[90,80,70],
    '영어':[98,89,95],
    '음악':[85,95,100],
    '체육':[100,90,90]
}

In [16]:
df = pd.DataFrame(dic,index=['서준','우현','인아'])

# 행삭제

In [17]:
#df2 = df 라고 쓰면 절대 안됨 call by ref 됨 
df2 = df.copy()

In [18]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [19]:
# df2의 index가 우현인 1개행을 삭제
df2.drop('우현',axis=0, inplace=True) # default 가 axis = 0 이라 안적어도 되긴하나 적는 습관이 좋음

In [20]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [21]:
df2 = df.copy()

In [22]:
# df3의 index가 우현과 인아인 2개 행을 삭제
df2.drop(['우현','인아'],inplace=True)
df2

    수학  영어  음악   체육
서준  90  98  85  100

In [23]:
# 열 삭제
df4 = df.copy()

In [24]:
df4

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [25]:
# df4의 수학 1개 열을 삭제
df4.drop('수학',axis=1,inplace=True)
df4

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [26]:
df5 = df.copy()
df5

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [27]:
# df5의 영어와 음악 2개 열을 삭제
df5.drop(['음악','영어'],axis=1, inplace=True)
df5

    수학   체육
서준  90  100
우현  80   90
인아  70   90

In [28]:
df.iloc[1,:-1]

수학    80
영어    89
음악    95
Name: 우현, dtype: int64

In [29]:
df.T

     서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [30]:
df.value_counts()

수학  영어  음악   체육
70  95  100  90     1
80  89  95   90     1
90  98  85   100    1
dtype: int64

In [31]:
df.count()

수학    3
영어    3
음악    3
체육    3
dtype: int64

In [32]:
print(df.value_counts())

수학  영어  음악   체육
70  95  100  90     1
80  89  95   90     1
90  98  85   100    1
dtype: int64

In [33]:
df.count()

수학    3
영어    3
음악    3
체육    3
dtype: int64

---

### 행선택
- index 이름을 기준으로 선택할 경우에는 loc
- 정수형 위치 index를 사용할 경우에는 iloc

In [34]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [39]:
# index가 서준인 행을 선택
print(df.loc['서준'])
print(df.iloc[0])

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64
수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [50]:
# 행 인덱스를 사용하여 서준과 우현 2개의 행을 선택
# loc사용
print(df.loc[['서준','우현']])

# iloc사용
print(df.iloc[[0,1]])
print(df.iloc[0:2])
print(df.iloc[list(range(0,2,1))])

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [78]:
list(df.columns).index('영어')

1

# 열선택

In [79]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [80]:
df['수학']

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [81]:
df.수학

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

### 범위 Slicing 활용
- dataFrame.iloc[시작index:끝index:증가치]

In [82]:
df.iloc[::2]

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [130]:
df.iloc[:,::-1]

    국어  체육   음악  영어  수학
이름
서준  80  80   85  98  90
우현  80  90   95  89  80
인아  80  90  100  95  70
철수  50  40   30  20  10
영희  80  90  100  95  70

In [84]:
df.iloc[1:3:2]

    수학  영어  음악  체육
우현  80  89  95  90

## 행과 열을 이용한 데이터 선택

In [87]:
dic = {
    '수학':[90,80,70],
    '영어':[98,89,95],
    '음악':[85,95,100],
    '체육':[100,90,90],
    '이름':['서준','우현','인아']
}
df = pd.DataFrame(dic)
df

   수학  영어   음악   체육  이름
0  90  98   85  100  서준
1  80  89   95   90  우현
2  70  95  100   90  인아

In [88]:
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [109]:
print(df.loc['서준',['음악','체육']])
print(df.iloc[0,2:])
print(df.loc['서준','음악':'체육'])
print(df.loc['서준','음악':])

음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64

In [118]:
df['국어'] = 80
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

In [122]:
df.loc['철수'] = [10,20,30,40,50]
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80
철수  10  20   30   40  50

In [124]:
df.loc['영희'] = df.loc['인아']
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80
철수  10  20   30   40  50
영희  70  95  100   90  80

In [127]:
# 서준의 체육점수를 80점으로 변경하기
df.loc['서준','체육'] = 80
df

    수학  영어   음악  체육  국어
이름
서준  90  98   85  80  80
우현  80  89   95  90  80
인아  70  95  100  90  80
철수  10  20   30  40  50
영희  70  95  100  90  80

In [140]:
df.loc['서준',['음악','체육']] = 50
df

    수학  영어   음악  체육  국어
이름
서준  90  98   50  50  80
우현  80  89   95  90  80
인아  70  95  100  90  80
철수  10  20   30  40  50
영희  70  95  100  90  80

In [143]:
# 서준의 음악 점수를 100점 체육점수를 50점으로 변경하기
df.loc['서준',['음악','체육']] = 100,50
df

    수학  영어   음악  체육  국어
이름
서준  90  98  100  50  80
우현  80  89   95  90  80
인아  70  95  100  90  80
철수  10  20   30  40  50
영희  70  95  100  90  80

In [144]:
# 행과 열의 위치 바꾸기
df

    수학  영어   음악  체육  국어
이름
서준  90  98  100  50  80
우현  80  89   95  90  80
인아  70  95  100  90  80
철수  10  20   30  40  50
영희  70  95  100  90  80

In [146]:
df.transpose()

이름   서준  우현   인아  철수   영희
수학   90  80   70  10   70
영어   98  89   95  20   95
음악  100  95  100  30  100
체육   50  90   90  40   90
국어   80  80   80  50   80

In [147]:
df.T

이름   서준  우현   인아  철수   영희
수학   90  80   70  10   70
영어   98  89   95  20   95
음악  100  95  100  30  100
체육   50  90   90  40   90
국어   80  80   80  50   80

In [148]:
li = []
for i in range(1,4):
    li.append(list(range(i,i+3*4+1,3)))
pd.DataFrame(li,index=['r0','r1','r2'],columns=['c0','c1','c2','c3','c4'])

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [158]:
df = pd.DataFrame([list(range(i,i+3*4+1,3)) for i in range(1,4) ],index=['r0','r1','r2'],columns=['c0','c1','c2','c3','c4'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [169]:
# 인덱스 재설정하기
new_index = ['r0','r1','r2','r3','r4']
ndf = df.reindex(new_index, fill_value= 0) # fill_value 말고 nan 체크 하는 게 파이썬에 몇개더 있음
ndf.dtypes

c0    int64
c1    int64
c2    int64
c3    int64
c4    int64
dtype: object

In [170]:
ndf = df.reset_index()
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [176]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [179]:
# 내림차순으로 행 인덱스 정렬
df.sort_index(ascending=False)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [180]:
# 특정 값을 기준으로 정렬
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [183]:
df.sort_values(by = 'c1', ascending=False, inplace=True)
df

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

# DataFrame 연산

In [184]:
import seaborn as sns

In [185]:
titanic = sns.load_dataset('titanic')
titanic.head()

# 특성공학(column Engineering) 때문에 who 컬럼부터 추가된 데이터이다.

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [220]:
# titanic에서 age와 fare부분의 컬럼만 발췌하여 df라는 dataFrame 만들기
df = titanic.loc[:,['age','fare']]
df.head(1)

    age  fare
0  22.0  7.25

In [208]:
df2 = pd.DataFrame(titanic.age)
df2['fare'] = titanic.fare
df2.head(1)

    age  fare
0  22.0  7.25

In [209]:
dic01 = {
    'age' : list(titanic.age),
    'fare' : list(titanic.fare)
}
pd.DataFrame(dic01).head(1)

    age  fare
0  22.0  7.25

In [216]:
df.describe()

              age        fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [221]:
# 모든 컬럼을 10씩 증가하여 addition이라는 DataFrame 생성하기
addition = df +10
addition.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [223]:
# addition과 df의 차이를 구하여 subtraction이라는 Dataframe 만들기
subtraction = addition - df
subtraction.head()

    age  fare
0  10.0  10.0
1  10.0  10.0
2  10.0  10.0
3  10.0  10.0
4  10.0  10.0